// ============================================================================
// Fichero: Medidor.h
// Descripción: Módulo simulador de lectura de sensores de gas ozono
// Copyright: (c) 2026 Sergio García Camacho
// Fecha: 14/10/2026
// Autor: Sergio García Camacho
// Aportación: Simulación de lectura para prueba presencial de evaluación
// ============================================================================
#ifndef MEDIDOR_H_INCLUIDO
#define MEDIDOR_H_INCLUIDO

// ------------------------------------------------------
// ------------------------------------------------------
class Medidor {

  // .....................................................
  // .....................................................
private:

public:

  // .....................................................
  // constructor
  // .....................................................
  Medidor(  ) {
  } // ()

  // .....................................................
  // .....................................................
  void iniciarMedidor() {
	// las cosas que no se puedan hacer en el constructor, if any
  } // ()

  // .....................................................
  // .....................................................
  // >>> AQUÍ CAMBIAS EL VALOR DE PRUEBA QUE TE PIDA EL PROFESOR <<<
  int medirCO2() {
	return 1234; // Cambiar este número por el que te pida el profesor en la defensa
  } // ()

  // .....................................................
  // .....................................................
  int medirTemperatura() {
	return -12; // qué frío !
  } // ()
	
}; // class

// ------------------------------------------------------
// ------------------------------------------------------
// ------------------------------------------------------
// ------------------------------------------------------
#endif
